# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone coco 数据集使用的主干网络
# backbone:
#   # [from, repeats, module, args]              特征图大小
#   - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2         320
#   - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4        160
#   - [-1, 2, TransMoVE, [128, 25, 3]]
#   - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8        80
#   - [-1, 2, TransMoVE, [256, 25, 3]]
#   - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16     40
#   - [-1, 2, TransMoVE, [512, 16, 3]]
#   - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32    20
#   - [-1, 2, TransMoVE, [1024, 16, 3]]
#   - [-1, 1, SPPF, [1024, 5]] # 9
#   - [-1, 2, C2PSA, [1024]] # 10

backbone:
  # [from, repeats, module, args]              特征图大小
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2         320
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4        160
  - [-1, 2, TransMoVE, [128, 16, 3]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8        80
  - [-1, 2, TransMoVE, [256, 16, 3]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16     40
  - [-1, 2, TransMoVE, [512, 16, 3]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32    20
  - [-1, 2, TransMoVE, [1024, 16, 3]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)

# 第4层为Conv，专家数量为16
#YOLO113n summary: 343 layers, 2,609,872 parameters, 2,609,856 gradients, 7.0 GFLOPs
    #     num_experts: int = 16
    #     YOLO113n summary: 166 layers, 2,555,428 parameters, 0 gradients, 6.6 GFLOPs
    #                  Class     Images  Instances      Box(P          R      mAP50  mAP50-95): 100%|██████████| 39/39 [00:11<00:00,  3.29it/s]
    #                    all       4952      12032      0.808      0.735      0.816      0.617
    #              aeroplane        204        285      0.901      0.798      0.891       0.67
    #                bicycle        239        337      0.885       0.84      0.912      0.704
    #                   bird        282        459      0.797      0.675       0.77      0.543
    #                   boat        172        263      0.749      0.677      0.752      0.495
    #                 bottle        212        469      0.847      0.569      0.706      0.482
    #                    bus        174        213      0.855      0.798      0.873      0.767
    #                    car        721       1201      0.883      0.826      0.914      0.738
    #                    cat        322        358      0.834      0.838       0.88      0.702
    #                  chair        417        756      0.747      0.496      0.638      0.433
    #                    cow        127        244      0.741      0.824      0.848       0.64
    #            diningtable        190        206      0.745      0.728      0.764       0.61
    #                    dog        418        489      0.786      0.753      0.849      0.663
    #                  horse        274        348      0.859      0.874      0.918      0.738
    #              motorbike        222        325      0.876      0.801      0.899      0.656
    #                 person       2007       4528      0.891      0.764      0.874      0.607
    #            pottedplant        224        480      0.689       0.39       0.52       0.29
    #                  sheep         97        242        0.7       0.76      0.821      0.634
    #                   sofa        223        239      0.635      0.741      0.786      0.653
    #                  train        259        282      0.879      0.852      0.903      0.691
    #              tvmonitor        229        308      0.871      0.699      0.796      0.615
    # Speed: 0.1ms preprocess, 1.3ms inference, 0.0ms loss, 0.2ms postprocess per image
    # Results saved to runs/yolo11_VOC/113n133

# 将专家数量由16改为25
# YOLO113n summary: 343 layers, 2,627,854 parameters, 2,627,838 gradients, 7.1 GFLOPs
# YOLO113n summary (fused): 214 layers, 2,587,490 parameters, 0 gradients, 6.8 GFLOPs
#                  Class     Images  Instances      Box(P          R      mAP50  mAP50-95): 100%|██████████| 39/39 [00:14<00:00,  2.76it/s]
#                    all       4952      12032      0.819      0.727      0.812      0.616
#              aeroplane        204        285      0.877      0.818      0.889      0.665
#                bicycle        239        337      0.903      0.801      0.897      0.699
#                   bird        282        459      0.811      0.686      0.786      0.548
#                   boat        172        263      0.709      0.654      0.714      0.474
#                 bottle        212        469      0.878      0.523      0.675      0.463
#                    bus        174        213      0.852      0.775      0.855      0.752
#                    car        721       1201      0.895      0.815      0.912      0.737
#                    cat        322        358      0.867      0.827      0.892      0.718
#                  chair        417        756      0.786      0.481      0.633      0.433
#                    cow        127        244       0.68      0.836      0.847      0.648
#            diningtable        190        206      0.729      0.731      0.776      0.617
#                    dog        418        489      0.837      0.767      0.849      0.662
#                  horse        274        348      0.853       0.87       0.92      0.736
#              motorbike        222        325       0.88      0.806      0.895       0.66
#                 person       2007       4528      0.888      0.772      0.877      0.613
#            pottedplant        224        480      0.718      0.393      0.516      0.289
#                  sheep         97        242      0.745       0.76      0.811      0.619
#                   sofa        223        239      0.674      0.761      0.792      0.659
#                  train        259        282      0.902      0.845      0.892      0.697
#              tvmonitor        229        308      0.885      0.626      0.807      0.627
# Speed: 0.1ms preprocess, 1.8ms inference, 0.0ms loss, 0.2ms postprocess per image
# Results saved to runs/yolo11_VOC/113n152